app/controllers/projects_controller.rb

    def create
        @project = Project.create(project_params)
---
INSERT INTO "projects" ("title", "synopsis", "owner_id", "deadline", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "fsdgsg"], ["synopsis", "gdsgsdg"], ["owner_id", 5], ["deadline", "2019-05-08"], ["created_at", "2019-05-08 19:08:26.203039"], ["updated_at", "2019-05-08 19:08:26.203039"]]