app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("description", "complete", "user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "Tomato"], ["complete", false], ["user_id", 3], ["project_id", 6], ["created_at", "2019-05-09 15:28:25.669825"], ["updated_at", "2019-05-09 15:28:25.669825"]]
---
    def create
        @task = Task.create(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "TESTING NOW"], ["updated_at", "2019-05-09 16:17:27.057904"], ["id", 9]]
---
    def update
        @task = Task.find(params[:id])
        if @task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 5]]
---
    def destroy
        @return_project = Task.find(params[:id])
        Task.destroy(params[:id])